Revit 2027 API
PrintManager.SubmitPrint(View) Method
 Print a view with the current PrintManager settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SubmitPrint(
	View view
)
Public Function SubmitPrint (
	view As View
) As Boolean
public:
bool SubmitPrint(
	View^ view
)
member SubmitPrint :
        view : View -> bool
Parameters
view View
The User-assigned view.
Return Value
Boolean
True if successful, otherwise False.
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when this operation is not allowed in the current application mode, or the print resource is occupied by others.
Remarks
 PrintManager will apply the local settings to global and print the user-assigned view with the current settings.
See Also
Reference
PrintManager Class
SubmitPrint Overload
Autodesk.Revit.DB Namespace